tap "derailed/k9s"
tap "fluxcd/tap"
tap "go-task/tap"
tap "guitmz/tools"
tap "oven-sh/bun"
tap "sass/sass"
tap "tinted-theming/tinted"

brew "gcc"

# System utilities
brew "usbutils"
brew "pstree"
brew "bat"
brew "eza"
brew "tree"


# System info
brew "neofetch"
brew "htop"
brew "bottom"
brew "bpytop"


# Disk
brew "ncdu"
brew "duf"
brew "dua-cli"
brew "dust"


# Binaries
brew "hexyl"


# Theme and appearance
brew "tinted-theming/tinted/tinty"
brew "stow"

brew "asdf"
brew "age"


# Git tools
brew "git"
brew "git-delta"


# Editors
brew "vim"
brew "neovim"


# Formatting tools
brew "jq"
brew "yq"


# Build tools
brew "autoconf"
brew "automake"
brew "binutils"
brew "cmake"
brew "pkgconf"
brew "coreutils"
brew "gettext"
brew "texinfo"
brew "mtools"


# Languages
brew "zig"
brew "ruby"
brew "ocaml"
brew "nasm"
brew "go"
brew "golangci-lint"

brew "go-task"


# Shells
brew "zsh"


# Compression and file packaging/archive utility
brew "zip"
brew "sevenzip"


# Node.js tools
brew "node"
brew "oven-sh/bun/bun"
brew "nvm"

brew "sass/sass/sass"


# Python tools
brew "ipython"
brew "pipx"
brew "pyenv"


# Observability tools
brew "grpcurl"


# Benchmarking & stats tools
brew "speedtest-cli"
brew "wrk"
brew "scc"


# Testing tools


# Security tools


# Networking tools
brew "wget"
brew "tcptraceroute"
brew "openssh"
brew "nmap"
brew "mtr"
brew "gping"
brew "bmon"
brew "iftop"


# Hack tools
brew "hydra"
brew "gobuster"
brew "ffuf"
brew "sqlmap"
brew "john"
brew "nikto"
brew "nuclei"


# Database tools
brew "pgcli"
brew "mysql"


# Virtualization and emulation
brew "qemu"


# Containers
brew "docker"
brew "docker-compose"
brew "ctop"
brew "dive"
brew "earthly"


# k8s tools
brew "derailed/k9s/k9s"
brew "argocd"
brew "helm"
brew "fluxcd/tap/flux"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"


# Clouds
brew "oci-cli"


# Wobcom
brew "openfortivpn"
