tap "homebrew/cask"
tap "homebrew/core"

brew "telnet"

cask "apidog"
cask "binary-ninja-free"
cask "chromium"
cask "docker-desktop"
cask "firefox"
cask "flameshot"
cask "font-fira-code"
cask "ghostty"
cask "iterm2"
cask "rectangle"
cask "slack"
cask "yaak"
cask "visual-studio-code"

vscode "42crunch.vscode-openapi"
vscode "a-h.templ"
vscode "amodio.tsl-problem-matcher"
vscode "basdp.language-gas-x86"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bwork.zig-tools"
vscode "ctcuff.font-preview"
vscode "dancheg97.grpc-clicker"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.vscode-mysql"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "jock.svg"
vscode "kingwl.vscode-vitest-runner"
vscode "lucianirsigler.nasm"
vscode "marlosirapuan.nord-deep"
vscode "matt-meyers.vscode-dbml"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "nrwl.angular-console"
vscode "ocamllabs.ocaml-platform"
vscode "oven.bun-vscode"
vscode "pomdtr.excalidraw-editor"
vscode "prime31.zig"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "simonsiefke.svg-preview"
vscode "task.vscode-task"
vscode "tintedtheming.base16-tinted-themes"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "vitest.explorer"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wakatime.vscode-wakatime"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
